#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_network.vpc_network: Refreshing state... [id=projects/trial-cicd-a/global/networks/cicd-network]
google_service_account.api-invoker: Refreshing state... [id=projects/trial-cicd-a/serviceAccounts/api-invoker@trial-cicd-a.iam.gserviceaccount.com]
google_cloud_run_service.api-run: Refreshing state... [id=locations/us-central1/namespaces/trial-cicd-a/services/api-run]
google_compute_firewall.develop: Refreshing state... [id=projects/trial-cicd-a/global/firewalls/ssh-firewall]
google_compute_instance.decoy: Refreshing state... [id=projects/trial-cicd-a/zones/us-central1-c/instances/decoy]
google_compute_instance.sub-decoy["decoy-b"]: Refreshing state... [id=projects/trial-cicd-a/zones/us-central1-c/instances/decoy-b]
google_compute_instance.sub-decoy["decoy-a"]: Refreshing state... [id=projects/trial-cicd-a/zones/us-central1-c/instances/decoy-a]
google_compute_firewall.vpc-allow-internal: Refreshing state... [id=projects/trial-cicd-a/global/firewalls/vpc-allow-internal]
google_compute_firewall.frontend: Refreshing state... [id=projects/trial-cicd-a/global/firewalls/http-firewall]
google_compute_instance.sub-decoy["decoy-c"]: Refreshing state... [id=projects/trial-cicd-a/zones/us-central1-c/instances/decoy-c]
google_compute_instance.sub-decoy["decoy-d"]: Refreshing state... [id=projects/trial-cicd-a/zones/us-central1-c/instances/decoy-d]
google_compute_instance.nginx_instance: Refreshing state... [id=projects/trial-cicd-a/zones/us-central1-c/instances/reverse-proxy]
google_cloud_run_service_iam_binding.invokeer: Refreshing state... [id=v1/projects/trial-cicd-a/locations/us-central1/services/api-run/roles/run.invoker]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_instance.sub-decoy["decoy-a"] has been changed
  ~ resource "google_compute_instance" "sub-decoy" {
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy-a"
      + labels               = {}
      + metadata             = {}
        name                 = "decoy-a"
      + tags                 = []
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # google_compute_instance.sub-decoy["decoy-b"] has been changed
  ~ resource "google_compute_instance" "sub-decoy" {
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy-b"
      + labels               = {}
      + metadata             = {}
        name                 = "decoy-b"
      + tags                 = []
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # google_compute_instance.sub-decoy["decoy-c"] has been changed
  ~ resource "google_compute_instance" "sub-decoy" {
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy-c"
      + labels               = {}
      + metadata             = {}
        name                 = "decoy-c"
      + tags                 = []
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # google_compute_instance.sub-decoy["decoy-d"] has been changed
  ~ resource "google_compute_instance" "sub-decoy" {
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy-d"
      + labels               = {}
      + metadata             = {}
        name                 = "decoy-d"
      + tags                 = []
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.api-run will be updated in-place
  ~ resource "google_cloud_run_service" "api-run" {
        id       = "locations/us-central1/namespaces/trial-cicd-a/services/api-run"
        name     = "api-run"
        # (3 unchanged attributes hidden)


      ~ template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation  = 0 -> null
              - labels      = {} -> null
            }

          ~ spec {
              - container_concurrency = 80 -> null

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_instance.decoy must be replaced
-/+ resource "google_compute_instance" "decoy" {
      ~ cpu_platform         = "Unknown CPU Platform" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy" -> (known after apply)
      ~ instance_id          = "3550739296059097299" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      ~ machine_type         = "f1-micro" -> "e2-micro"
      - metadata             = {} -> null
      ~ metadata_fingerprint = "A1SZGIlq_2k=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "decoy"
      ~ project              = "trial-cicd-a" -> (known after apply)
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/trial-cicd-a/zones/us-central1-c/instances/decoy" -> (known after apply)
        tags                 = [
            "dev",
        ]
      ~ tags_fingerprint     = "xlip8CMnj60=" -> (known after apply)
      ~ zone                 = "us-central1-c" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/trial-cicd-a/zones/us-central1-c/disks/decoy" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2004-focal-v20210825" -> "ubuntu20-telegraf-decoy" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/trial-cicd-a/global/networks/cicd-network" -> "cicd-network"
          ~ network_ip         = "10.128.0.3" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/trial-cicd-a/regions/us-central1/subnetworks/cicd-network" -> (known after apply)
          ~ subnetwork_project = "trial-cicd-a" -> (known after apply)

          ~ access_config {
              + nat_ip       = (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }


      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
        # (1 unchanged block hidden)
    }

  # google_compute_instance.sub-decoy["decoy-a"] will be updated in-place
  ~ resource "google_compute_instance" "sub-decoy" {
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy-a"
      ~ machine_type         = "f1-micro" -> "e2-micro"
        name                 = "decoy-a"
        tags                 = []
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # google_compute_instance.sub-decoy["decoy-b"] will be updated in-place
  ~ resource "google_compute_instance" "sub-decoy" {
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy-b"
      ~ machine_type         = "f1-micro" -> "e2-micro"
        name                 = "decoy-b"
        tags                 = []
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # google_compute_instance.sub-decoy["decoy-c"] will be updated in-place
  ~ resource "google_compute_instance" "sub-decoy" {
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy-c"
      ~ machine_type         = "f1-micro" -> "e2-micro"
        name                 = "decoy-c"
        tags                 = []
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # google_compute_instance.sub-decoy["decoy-d"] will be updated in-place
  ~ resource "google_compute_instance" "sub-decoy" {
        id                   = "projects/trial-cicd-a/zones/us-central1-c/instances/decoy-d"
      ~ machine_type         = "f1-micro" -> "e2-micro"
        name                 = "decoy-d"
        tags                 = []
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marltake, Action: `pull_request`, Working Directory: ``, Workflow: `terraform CI/CD`*